hurrican/atlas-simulator/src/main/resources/templates/wita/v1/NEU_QEB_STORNO_STORNO/ABBM.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--Note: This file is generated by CDM transformation tool - do not modify this file manually!-->
<SOAP-ENV:Envelope
    xmlns="http://www.mnet.de/esb/cdm/SupplierPartner/LineOrderNotificationService/v1" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <notifyUpdateOrder>
            <order>
                <geschaeftsfall>NEU</geschaeftsfall>
                <aenderungsKennzeichen>Storno</aenderungsKennzeichen>
                <geschaeftsfallart>Bereitstellung</geschaeftsfallart>
            </order>
            <message>
                <ABBM>
                    <meldungsattribute>
                        <vertragsnummer>${contractId}</vertragsnummer>
                        <externeAuftragsnummer>${externalOrderId}</externeAuftragsnummer>
                        <kundennummer>${customerId}</kundennummer>
                        <kundennummerBesteller>${3rdPartySalesmanCustomerId}</kundennummerBesteller>
                        <wiedervorlagetermin>atlas:currentDatePlusWorkingDays('yyyy-MM-dd', 14)</wiedervorlagetermin>
                    </meldungsattribute>
                    <meldungspositionen>
                        <position>
                            <meldungscode>1086</meldungscode>
                            <meldungstext>Kundenauftrag ist nicht stornierbar, da Stornierung bereits angestoßen.</meldungstext>
                        </position>
                    </meldungspositionen>
                </ABBM>
            </message>
            <captured>citrus:currentDate(yyyy-MM-dd'T'HH:mm:ss)</captured>
        </notifyUpdateOrder>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
